import streamlit as st

# ส่วนหัวข้อเว็บ (Header)
st.title("ยินดีต้อนรับสู่โปรไฟล์ของฉัน ✨")
st.write("นี่คือเว็บแอปพลิเคชันแรกในชีวิตของผม เขียนด้วยภาษา Python ครับ")

st.divider() # เส้นคั่นแบ่งสัดส่วนให้สวยงาม

# ส่วนข้อมูลส่วนตัว (Profile Info)
st.header("👤 ข้อมูลส่วนตัว")
st.write("**ชื่อ-นามสกุล:** นายธุวานันท์ จิรัฏฐ์ธนากุล")
st.write("**ชั้น ม.4/4** เลขที่ 41")
st.write("**โรงเรียน:** ยุพราชวิทยาลัย")

# ส่วนปุ่มกดแสดงความรู้สึก
if st.button("คลิกบอกความรู้สึกกับการเขียนเว็บครั้งแรก"):
    st.success(f"ว้าว! สนุกและง่ายกว่าที่คิดมาก ๆ! 🎉")
